ezois_ka/oooezoiskaobmen/src/DataProcessors/ИнтеграцияКабинетСотрудника/ИнтеграцияКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтеграцияКабинетСотрудника</name>
</mdclass:DataProcessor>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/НастройкиЗаявленийНаОтпускКабинетСотрудника/НастройкиЗаявленийНаОтпускКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗаявленийНаОтпускКабинетСотрудника</name>
  <resources>
    <name>КонтролироватьДатуНачалаОтпускаПриПодачеЗаявления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейДоНачалаОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьНаличиеОтпускаМенее14дней</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверятьНаличиеРабочихДнейВПериодеОтпуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничиватьПредоставлениеОтпускаАвансом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоДнейОтпускаАвансом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбновитьНастройкиВСервисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияИзменений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейДоОтпускаДляИзмененияЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/НастройкиИнтеграцииКабинетСотрудника/НастройкиИнтеграцииКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииКабинетСотрудника</name>
  <resources>
    <name>УдалитьВидКонтактнойИнформацииМобильныйТелефон</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВидКонтактнойИнформацииАдресЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяЭДОБЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособПолученияСогласияНаПрисоединениеКЭДОБЗК</name>
    <type>
      <types>EnumRef.СпособыПолученияСогласияНаПрисоединениеКЭДОБЗК</types>
    </type>
  </resources>
  <resources>
    <name>ДнейСохраненияПубликации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПубликоватьСтруктуруЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОбсуждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧатБот</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>КоординаторОбсуждений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПриложенияСовместногоИспользования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСборДанныхДляОформленияНаРаботу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОтчетаРасчетныйЛисток</name>
    <type>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину</name>
    <type>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРасчетныеЛистыОтдельнымЗапросом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/НастройкиКабинетСотрудника/НастройкиКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКабинетСотрудника</name>
  <resources>
    <name>РазделЗарплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазделДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазделОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазделОтсутствия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазделСправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазделКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьГрафикОтпусков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявленияНаДСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаДСВПроцентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаДСВСуммой</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаДСВПроцентомНеБолееСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УровеньДоступаКИ</name>
    <type>
      <types>EnumRef.УровниДоступаКИнформацииОСотрудниках</types>
    </type>
  </resources>
  <resources>
    <name>ДоступенОтказОтПодписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьОхрануТруда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьРабочиеМестаОхраныТруда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьМедицинскиеОсмотры</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьПсихиатрическиеОсвидетельствования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПособияПриРожденииРебенка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПособияПоУходуЗаРебенком</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявленияНаВычетыНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПолучениеСканаОригинала</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПолучениеДокументаСЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПолучениеДокументаВБумажномВиде</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПолучениеКопииНаЭлектроннуюПочту</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапросНаИзменениеЛичнойИнформации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноИзменениеФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьОстаткиОтпусков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЗаявленияНаОтменуОтпуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЗаявленияНаПереносОтпуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявлениеНаОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявлениеУчебныйОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявлениеОтпускБезОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КомпенсацияОтпуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиновременнаяВыплатаКОтпуску</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МатериальнаяПомощьКОтпуску</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Справки2НДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СправкиСМестаРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СправкиОстаткиОтпусков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтсутствиеПоЛичнымОбстоятельствам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Опоздание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Болезнь</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Командировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтпускПоБеременностиИРодам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгул</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтпускПоУходуЗаРебенком</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УходЗаРебенкомИнвалидом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВозвратИзОтпускаПоУходуЗаРебенком</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/DataProcessors/ИнтеграцияКабинетСотрудника/Forms/НастройкиСервиса/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаЗаголовок = НСтр("ru = '1С:Кабинет сотрудника. Настройки'");
	Заголовок = СтрокаЗаголовок;
	
	СтрокаЗаголовок = НСтр("ru = 'Настройки функциональности сервиса 1С:Кабинет сотрудника'");
	Элементы.ДекорацияИнформация.Заголовок = СтрокаЗаголовок;
	
	ПрочитатьНастройки();
	УстановитьДоступностьНастроек();
	ОбновитьЭУ();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьНастройкиПриЗакрытииФормы", ЭтаФорма);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкиСервисаЗаявлениеНаОтпускПриИзменении(Элемент)
	
	Если Не НастройкиСервиса.ЗаявлениеНаОтпуск Тогда
		НастройкиСервиса.МатериальнаяПомощьКОтпуску = Ложь;
		НастройкиСервиса.ЕдиновременнаяВыплатаКОтпуску = Ложь;
	КонецЕсли;
	УстановитьДоступностьДоплатКОтпуску(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСервсаЗаявлениеОтпускБезОплатыПриИзменении(Элемент)
	
	Если Не НастройкиСервиса.ЗаявлениеОтпускБезОплаты Тогда
		ОтпускЗаСвойСчетОформлятьЗаднимЧислом = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускОформлятьЗаднимЧисломПриИзменении(Элемент)
	
	Если ОтпускОформлятьЗаднимЧислом И НастройкиОтпуска.КонтролироватьДатуНачалаОтпускаПриПодачеЗаявления Тогда
		НастройкиОтпуска.КонтролироватьДатуНачалаОтпускаПриПодачеЗаявления = Ложь;
		НастройкиОтпуска.КоличествоДнейДоНачалаОтпуска = 0;
		ОбновитьЭУКоличествоДнейДоНачалаОтпуска(ЭтаФорма);
		ОбновитьЭУОтпускОформлятьЗаднимЧислом(ЭтаФорма);
	Иначе
		ОбновитьЭУОтпускОформлятьЗаднимЧислом(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьДатуНачалаОтпускаПриПодачеЗаявленияПриИзменении(Элемент)
	
	Если Не НастройкиОтпуска.КонтролироватьДатуНачалаОтпускаПриПодачеЗаявления Тогда
		НастройкиОтпуска.КоличествоДнейДоНачалаОтпуска = 0;
	Иначе
		НастройкиОтпуска.КоличествоДнейДоНачалаОтпуска = 1;
	КонецЕсли;
	ОбновитьЭУКоличествоДнейДоНачалаОтпуска(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСервисаИспользоватьЗаявленияНаПереносОтпускаПриИзменении(Элемент)
	ОбновитьДоступностьЭУДнейДоНачалаОтпуска(ЭтаФорма, Истина);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСервисаИспользоватьЗаявленияНаОтменуОтпускаПриИзменении(Элемент)
	ОбновитьДоступностьЭУДнейДоНачалаОтпуска(ЭтаФорма, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьПредоставлениеОтпускаАвансомПриИзменении(Элемент)
	
	Если Не НастройкиОтпуска.ОграничиватьПредоставлениеОтпускаАвансом Тогда
		ОтпускАвансомНеПредоставляется 	= 0;
		ОтпускАвансомПредоставляется 	= 0;
	Иначе
		ОтпускАвансомПредоставляется 	= 0;
		ОтпускАвансомНеПредоставляется 	= 1;
	КонецЕсли;
	НастройкиОтпуска.МаксимальноеКоличествоДнейОтпускаАвансом = 0;
	ОбновитьЭУМаксимальноеКоличествоДнейОтпускаАвансом(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускАвансомНеПредоставляетсяПриИзменении(Элемент)
	
	ОтпускАвансомПредоставляется = 0;
	НастройкиОтпуска.МаксимальноеКоличествоДнейОтпускаАвансом = 0;
	ОбновитьЭУМаксимальноеКоличествоДнейОтпускаАвансом(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускАвансомПредоставляетсяПриИзменении(Элемент)
	ОтпускАвансомНеПредоставляется = 0;
	НастройкиОтпуска.МаксимальноеКоличествоДнейОтпускаАвансом = 1;
	ОбновитьЭУМаксимальноеКоличествоДнейОтпускаАвансом(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСервисаЗапросНаИзменениеЛичнойИнформацииПриИзменении(Элемент)
	
	Если Не НастройкиСервиса.ЗапросНаИзменениеЛичнойИнформации Тогда
		НастройкиСервиса.ДоступноИзменениеФото = Ложь;
	КонецЕсли;
	УстановитьДоступностьДоступноИзменениеФото(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСервисаЗаявленияНаДСВПриИзменении(Элемент)
	
	Если Не НастройкиСервиса.ЗаявленияНаДСВ Тогда
		НастройкиСервиса.СпособРасчетаДСВПроцентом = Ложь;
		НастройкиСервиса.СпособРасчетаДСВПроцентомНеБолееСуммы = Ложь;
		НастройкиСервиса.СпособРасчетаДСВСуммой = Ложь;
	КонецЕсли;
	
	ОбновитьЭУСпособРасчетаДСВ(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСервисаПоказыватьОхрануТрудаПриИзменении(Элемент)
	
	Если ИспользуетсяВерсияDTO_3_1 Тогда
		Если НастройкиСервиса.ПоказыватьОхрануТруда Тогда
			НастройкиСервиса.ПоказыватьРабочиеМестаОхраныТруда = Истина;
		Иначе
			НастройкиСервиса.ПоказыватьРабочиеМестаОхраныТруда 				= Ложь;
			НастройкиСервиса.ПоказыватьМедицинскиеОсмотры 					= Ложь;
			НастройкиСервиса.ПоказыватьПсихиатрическиеОсвидетельствования 	= Ложь;
		КонецЕсли;
	Иначе
		НастройкиСервиса.ПоказыватьРабочиеМестаОхраныТруда = НастройкиСервиса.ПоказыватьОхрануТруда;
	КонецЕсли;
	
	УстановитьДоступностьПодчиненныхНастроекОхраныТруда(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ЗаписатьНастройкиНаКлиенте() Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	
	Если ЗаписатьНастройкиНаКлиенте() Тогда
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройки(Команда)
	
	Если Модифицированность Тогда
		
		ЗаголовокВопроса = НСтр("ru = 'Подтверждение'");
		ТекстВопроса = НСтр("ru = 'Для обновления настроек необходимо сохранить данные.
		|Сохранить и продолжить?'");
	
		Оповещение = Новый ОписаниеОповещения("ОбновитьНастройкиПродолжение", ЭтотОбъект, ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,ЗаголовокВопроса);
		
	Иначе
		ОбновитьНастройкиСервиса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	
	ЗаголовокВопроса = НСтр("ru = 'Подтверждение'");
	ТекстВопроса = НСтр("ru = 'Будут установлены настройки функциональности сервиса по умолчанию.'");
	
	Оповещение = Новый ОписаниеОповещения("УстановитьНастройкиПоУмолчаниюПродолжение", ЭтотОбъект, ЭтаФорма);
	ПоказатьВопрос(Оповещение, ТекстВопроса, ИнтеграцияУправлениеПерсоналомКлиента.ОписаниеКнопокВопроса(),,,ЗаголовокВопроса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеНастроекСервиса

&НаКлиенте
Процедура ОбновитьНастройкиПродолжение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ЗаписатьНастройкиНаКлиенте() Тогда
			Модифицированность = Ложь;
			ОбновитьНастройкиСервиса();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиСервиса()

	Если СервисЗаблокирован() Тогда
		ТекстСообщения = ИнтеграцияКабинетСотрудникаКлиент.ТекстСообщенияОБлокировкеСервиса();
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ДлительнаяОперация = ДлительнаяОперацияОбновитьНастройкиСервиса();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Обновление настроек функциональности сервиса выполнено.'");
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьНастройкиСервисаЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиСервисаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'При выполнении фонового задания возникла ошибка:'") + Символы.ПС + Результат.КраткоеПредставлениеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если РезультатВыполнения.БылиОшибки Тогда
		СообщениеОбОшибке = НСтр("ru = 'Не удалсь обновить настройки функциональности. Подробнее см в журнале регистрации.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияОбновитьНастройкиСервиса()

	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.Вставить("НаименованиеФоновогоЗадания", НСтр("ru = 'Обновление настроек функциональности сервиса'"));
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияКабинетСотрудника.ОбновитьНастройкиСервисаФоновоеЗадание",
		Неопределено,
		ПараметрыВыполненияВФоне);
		
	Возврат ДлительнаяОперация;

КонецФункции

#КонецОбласти

#Область УстановитьНастройкиПоУмолчанию

&НаКлиенте
Процедура УстановитьНастройкиПоУмолчаниюПродолжение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьНастройкиПоУмолчаниюНаСервере();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПоУмолчаниюНаСервере()

	Настройки = ИнтеграцияКабинетСотрудника.НастройкиСервисаПоУмолчанию();
	ЗаполнитьЗначенияСвойств(НастройкиСервиса, Настройки);
	
	НастройкиИнтеграции.ДнейСохраненияПубликации = 5;
	
	Настройки = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(РегистрыСведений.НастройкиЗаявленийНаОтпускКабинетСотрудника.СоздатьМенеджерЗаписи(),
							Метаданные.РегистрыСведений.НастройкиЗаявленийНаОтпускКабинетСотрудника);
	ЗаполнитьЗначенияСвойств(НастройкиОтпуска, Настройки);
	
	ОтпускОформлятьЗаднимЧислом 					= Ложь;
	ОтпускДнейДоНачалаОтсутствияОтмена 				= 0;
	ОтпускЗаСвойСчетОформлятьЗаднимЧислом 			= Ложь;
	ОтпускЗаСвойСчетДнейДоНачалаОтсутствияОтмена 	= 0;
	УчебныйОтпускОформлятьЗаднимЧислом 				= Ложь;
	КомандировкаОформлятьЗаднимЧислом 				= Ложь;
	ОтгулОформлятьЗаднимЧислом 						= Ложь;
	ЛичныеДелаОформлятьЗаднимЧислом 				= Ложь;
	
	ОбновитьЭУ();

КонецПроцедуры

#КонецОбласти

#Область ЗаписьНастроек

&НаКлиенте
Функция ЗаписатьНастройкиПриЗакрытииФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗаписатьНастройкиНаКлиенте() Тогда
		Модифицированность = Ложь;
		Закрыть();
	Иначе
		ВызватьИсключение НСтр("ru = 'Не удалось сохранить настройки.'");
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ЗаписатьНастройкиНаКлиенте()
	
	СообщениеОбОшибке = Неопределено;
	ЗаписатьНастройкиНаСервере(СообщениеОбОшибке);
	Если СообщениеОбОшибке <> Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;
	
	Возврат (СообщениеОбОшибке = Неопределено);

КонецФункции

&НаСервере
Процедура ЗаписатьНастройкиНаСервере(СообщениеОбОшибке)
	
	// Проверка настроек.
	Если НастройкиСервиса.ЗаявленияНаДСВ
		И Не НастройкиСервиса.СпособРасчетаДСВПроцентом
		И Не НастройкиСервиса.СпособРасчетаДСВСуммой
		И Не НастройкиСервиса.СпособРасчетаДСВПроцентомНеБолееСуммы Тогда
		НастройкиСервиса.ЗаявленияНаДСВ = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиЗаявленийНаОтпускКабинетСотрудника");
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиИнтеграцииКабинетСотрудника");
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиОтсутствийКабинетСотрудника");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ТекущиеНастройки = РегистрыСведений.НастройкиЗаявленийНаОтпускКабинетСотрудника.НастройкиЗаявокНаОтпуск();
		НовыеНастройки = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(НастройкиОтпуска, Метаданные.РегистрыСведений.НастройкиЗаявленийНаОтпускКабинетСотрудника);
		Если Не ОбщегоНазначения.КоллекцииИдентичны(ТекущиеНастройки, НовыеНастройки,,"ОбновитьНастройкиВСервисе") Тогда
			НовыеНастройки.ОбновитьНастройкиВСервисе = Истина;
			РегистрыСведений.НастройкиЗаявленийНаОтпускКабинетСотрудника.СохранитьНовыеНастройки(НовыеНастройки);
		КонецЕсли;
		
		ТекущиеНастройки = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.НастройкиИнтеграции();
		Если ТекущиеНастройки.ДнейСохраненияПубликации <> НастройкиИнтеграции.ДнейСохраненияПубликации Тогда
			РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СохранитьЗначениеДнейСохраненияПубликации(НастройкиИнтеграции.ДнейСохраненияПубликации);
		КонецЕсли;
		
		ТекущиеНастройки = РегистрыСведений.НастройкиКабинетСотрудника.Настройки();
		НовыеНастройки = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(НастройкиСервиса, Метаданные.РегистрыСведений.НастройкиКабинетСотрудника);
		Если Не ОбщегоНазначения.КоллекцииИдентичны(ТекущиеНастройки, НовыеНастройки) Тогда
			ИнтеграцияКабинетСотрудника.СохранитьНастройкиФункциональностиСервиса(НовыеНастройки, Истина);
		КонецЕсли;
		
		ТекущиеНастройки = РегистрыСведений.НастройкиОтсутствийКабинетСотрудника.Настройки(ПричиныОтсутствий);
		НовыеНастройки = ТекущиеНастройки.СкопироватьКолонки();
		Для каждого Настройка Из ТекущиеНастройки Цикл
			Если Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.Отпуск Тогда
				Если Настройка.ОформлятьЗаднимЧислом <> ОтпускОформлятьЗаднимЧислом
					Или Настройка.КоличествоДнейДоНачалаОтсутствияДляИзмененияЗаявки <> ОтпускДнейДоНачалаОтсутствияОтмена Тогда
					НоваяСтрока = НовыеНастройки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Настройка);
					НоваяСтрока.ОформлятьЗаднимЧислом = ОтпускОформлятьЗаднимЧислом;
					НоваяСтрока.КоличествоДнейДоНачалаОтсутствияДляИзмененияЗаявки = ОтпускДнейДоНачалаОтсутствияОтмена;
					НоваяСтрока.ТребуетсяОбновление = Истина;
				КонецЕсли;
			ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.ОтпускЗаСвойСчет Тогда
				Если Настройка.ОформлятьЗаднимЧислом <> ОтпускЗаСвойСчетОформлятьЗаднимЧислом
					Или Настройка.КоличествоДнейДоНачалаОтсутствияДляИзмененияЗаявки <> ОтпускЗаСвойСчетДнейДоНачалаОтсутствияОтмена Тогда
					НоваяСтрока = НовыеНастройки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Настройка);
					НоваяСтрока.ОформлятьЗаднимЧислом = ОтпускЗаСвойСчетОформлятьЗаднимЧислом;
					НоваяСтрока.КоличествоДнейДоНачалаОтсутствияДляИзмененияЗаявки = ОтпускЗаСвойСчетДнейДоНачалаОтсутствияОтмена;
					НоваяСтрока.ТребуетсяОбновление = Истина;
				КонецЕсли;
			ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.УчебныйОтпуск Тогда
				Если Настройка.ОформлятьЗаднимЧислом <> УчебныйОтпускОформлятьЗаднимЧислом Тогда
					НоваяСтрока = НовыеНастройки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Настройка);
					НоваяСтрока.ОформлятьЗаднимЧислом = УчебныйОтпускОформлятьЗаднимЧислом;
					НоваяСтрока.ТребуетсяОбновление = Истина;
				КонецЕсли;
			ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.Командировка Тогда
				Если Настройка.ОформлятьЗаднимЧислом <> КомандировкаОформлятьЗаднимЧислом Тогда
					НоваяСтрока = НовыеНастройки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Настройка);
					НоваяСтрока.ОформлятьЗаднимЧислом = КомандировкаОформлятьЗаднимЧислом;
					НоваяСтрока.ТребуетсяОбновление = Истина;
				КонецЕсли;
			ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.Отгул Тогда
				Если Настройка.ОформлятьЗаднимЧислом <> ОтгулОформлятьЗаднимЧислом Тогда
					НоваяСтрока = НовыеНастройки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Настройка);
					НоваяСтрока.ОформлятьЗаднимЧислом = ОтгулОформлятьЗаднимЧислом;
					НоваяСтрока.ТребуетсяОбновление = Истина;
				КонецЕсли;
			ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.ЛичныеДела Тогда
				Если Настройка.ОформлятьЗаднимЧислом <> ЛичныеДелаОформлятьЗаднимЧислом Тогда
					НоваяСтрока = НовыеНастройки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Настройка);
					НоваяСтрока.ОформлятьЗаднимЧислом = ЛичныеДелаОформлятьЗаднимЧислом;
					НоваяСтрока.ТребуетсяОбновление = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(НовыеНастройки) Тогда
			Для каждого Настройка Из НовыеНастройки Цикл
				МенеджерЗаписи = РегистрыСведений.НастройкиОтсутствийКабинетСотрудника.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Настройка);
				МенеджерЗаписи.Записать();
			КонецЦикла;
		КонецЕсли;

		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		СообщениеОбОшибке = НСтр("ru = 'Не удалось сохранить настройки. Подробности см. в журнале регистрации.'");
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИнтеграцияКабинетСотрудника.ИменаСобытийЖР().ПрочиеСобытия, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
		
	КонецПопытки;
	

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПрочитатьНастройки()
	
	ЗаполнитьЗначенияСвойств(НастройкиИнтеграции, РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.НастройкиИнтеграции());
	ЗаполнитьЗначенияСвойств(НастройкиСервиса, РегистрыСведений.НастройкиКабинетСотрудника.Настройки());
	
	ЗаполнитьЗначенияСвойств(НастройкиОтпуска, РегистрыСведений.НастройкиЗаявленийНаОтпускКабинетСотрудника.НастройкиЗаявокНаОтпуск());
	Если НастройкиОтпуска.ОграничиватьПредоставлениеОтпускаАвансом Тогда
		Если НастройкиОтпуска.МаксимальноеКоличествоДнейОтпускаАвансом = 0 Тогда
			ОтпускАвансомНеПредоставляется = 1;
			ОтпускАвансомПредоставляется = 0;
		Иначе
			ОтпускАвансомНеПредоставляется = 0;
			ОтпускАвансомПредоставляется = 1;
		КонецЕсли;
	Иначе
		ОтпускАвансомНеПредоставляется = 0;
		ОтпускАвансомПредоставляется = 0;
	КонецЕсли;
	
	ПричиныОтсутствийЗаявок = РегистрыСведений.НастройкиОтсутствийКабинетСотрудника.ДоступныеПричиныОтсутствий();
	ПричиныОтсутствий = Новый ФиксированныйМассив(ПричиныОтсутствийЗаявок);
	Настройки = РегистрыСведений.НастройкиОтсутствийКабинетСотрудника.Настройки(ПричиныОтсутствий);
	Для каждого Настройка Из Настройки Цикл
		Если Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.Отпуск Тогда
			ОтпускОформлятьЗаднимЧислом 		= Настройка.ОформлятьЗаднимЧислом;
			ОтпускДнейДоНачалаОтсутствияОтмена 	= Настройка.КоличествоДнейДоНачалаОтсутствияДляИзмененияЗаявки;
		ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.ОтпускЗаСвойСчет Тогда
			ОтпускЗаСвойСчетОформлятьЗаднимЧислом 			= Настройка.ОформлятьЗаднимЧислом;
			ОтпускЗаСвойСчетДнейДоНачалаОтсутствияОтмена 	= Настройка.КоличествоДнейДоНачалаОтсутствияДляИзмененияЗаявки;
		ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.УчебныйОтпуск Тогда
			УчебныйОтпускОформлятьЗаднимЧислом = Настройка.ОформлятьЗаднимЧислом;
		ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.Командировка Тогда
			КомандировкаОформлятьЗаднимЧислом = Настройка.ОформлятьЗаднимЧислом;
		ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.Отгул Тогда
			ОтгулОформлятьЗаднимЧислом = Настройка.ОформлятьЗаднимЧислом;
		ИначеЕсли Настройка.ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.ЛичныеДела Тогда
			ЛичныеДелаОформлятьЗаднимЧислом = Настройка.ОформлятьЗаднимЧислом;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьНастроек()
	
	ИспользуетсяВерсияDTO_2_4 = ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("2.4");
	УстановитьВидимостьЭУ("ГруппаДнейУдаленияКабинета", ИспользуетсяВерсияDTO_2_4);
	
	ДоступныеНастройки = ИнтеграцияКабинетСотрудника.ДоступныеНастройкиСервиса();
	ДоступенРасширенныйФункционал = ИнтеграцияУправлениеПерсоналом.ДоступенРасширенныйФункционал();
	ДоступенРасчетЗарплатыДляНебольшихОрганизаций = ИнтеграцияУправлениеПерсоналом.ДоступенРасчетЗарплатыДляНебольшихОрганизаций();
	ИспользуетсяВерсияDTO_2_0 = ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("2.0");
	ИспользуетсяВерсияDTO_3_1 = ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.1");
	
	// Разделы.
	ПоказыватьГруппуРазделы =  ДоступныеНастройки.РазделДокументы
		Или ДоступныеНастройки.РазделОтпуск
		Или ДоступныеНастройки.РазделКомпания
		Или ДоступныеНастройки.РазделЗарплата
		Или ДоступныеНастройки.РазделОтсутствия
		Или ДоступныеНастройки.РазделСправки;
	
	УстановитьВидимостьЭУ("ГруппаРазделы", ПоказыватьГруппуРазделы);
	УстановитьВидимостьЭУ("НастройкиСервисаРазделДокументы", 	ДоступныеНастройки.РазделДокументы);
	УстановитьВидимостьЭУ("НастройкиСервисаРазделОтпуск", 		ДоступныеНастройки.РазделОтпуск);
	УстановитьВидимостьЭУ("НастройкиСервисаРазделКомпания", 	ДоступныеНастройки.РазделКомпания);
	УстановитьВидимостьЭУ("НастройкиСервисаРазделЗарплата", 	ДоступныеНастройки.РазделЗарплата);
	УстановитьВидимостьЭУ("НастройкиСервисаРазделОтсутствия", 	ДоступныеНастройки.РазделОтсутствия);
	УстановитьВидимостьЭУ("НастройкиСервисаРазделСправки", 		ДоступныеНастройки.РазделСправки);
	
	// Справки.
	УстановитьВидимостьЭУ("НастройкиСервисаСправки2НДФЛ", 			ДоступныеНастройки.Справки2НДФЛ);
	УстановитьВидимостьЭУ("НастройкиСервисаСправкиСМестаРаботы", 	ДоступныеНастройки.СправкиСМестаРаботы);
	УстановитьВидимостьЭУ("НастройкиСервисаСправкиОстаткиОтпусков", ДоступныеНастройки.СправкиОстаткиОтпусков);
	УстановитьВидимостьЭУ("НастройкиСервисаДоступноПолучениеСканаОригинала", 			ДоступныеНастройки.ДоступноПолучениеСканаОригинала);
	УстановитьВидимостьЭУ("НастройкиСервисаДоступноПолучениеДокументаВБумажномВиде", 	ДоступныеНастройки.ДоступноПолучениеДокументаВБумажномВиде);
	УстановитьВидимостьЭУ("НастройкиСервисаДоступноПолучениеДокументаСЭП", 				ДоступныеНастройки.ДоступноПолучениеДокументаСЭП);
	УстановитьВидимостьЭУ("НастройкиСервисаДоступноПолучениеКопииНаЭлектроннуюПочту", 	ДоступныеНастройки.ДоступноПолучениеКопииНаЭлектроннуюПочту);
	
	// Отпуска.
	ПоказыватьГруппуОтпуска = ДоступенРасширенныйФункционал Или ДоступенРасчетЗарплатыДляНебольшихОрганизаций;
	УстановитьВидимостьЭУ("ГруппаОтпуска", ПоказыватьГруппуОтпуска);
	Если ПоказыватьГруппуОтпуска Тогда
		
		// Расширенные настройки заявлений на отпуск.
		УстановитьВидимостьЭУ("ГруппаНастройкиОтпускаРасширенные", ДоступенРасширенныйФункционал);
		
		УстановитьВидимостьЭУ("ГруппаДоступныеЗаявленияНаОтпуск", ИспользуетсяВерсияDTO_2_0);
		
		УстановитьВидимостьЭУ("НастройкиСервисаПоказыватьГрафикОтпусков", 	ДоступныеНастройки.ПоказыватьГрафикОтпусков);
		УстановитьВидимостьЭУ("ДекорацияОтступОтпуска", 					ДоступныеНастройки.ПоказыватьГрафикОтпусков);
		УстановитьВидимостьЭУ("НастройкиСервисаПоказыватьОстаткиОтпусков", 	ДоступныеНастройки.ПоказыватьОстаткиОтпусков);
		
		УстановитьВидимостьЭУ("НастройкиСервисаЗаявлениеНаОтпуск", ДоступныеНастройки.ЗаявлениеНаОтпуск);
		УстановитьВидимостьЭУ("ГруппаДоплатыКОтпускуГлавная", ДоступныеНастройки.МатериальнаяПомощьКОтпуску Или ДоступныеНастройки.ЕдиновременнаяВыплатаКОтпуску);
		УстановитьВидимостьЭУ("НастройкиСервисаМатериальнаяПомощьКОтпуску", 	ДоступныеНастройки.МатериальнаяПомощьКОтпуску);
		УстановитьВидимостьЭУ("НастройкиСервисаЕдиновременнаяВыплатаКОтпуску", 	ДоступныеНастройки.ЕдиновременнаяВыплатаКОтпуску);
		
		УстановитьВидимостьЭУ("НастройкиСервисаКомпенсацияОтпуска", 		ДоступныеНастройки.КомпенсацияОтпуска);
		УстановитьВидимостьЭУ("НастройкиСервисаЗаявлениеУчебныйОтпуск", 	ДоступныеНастройки.ЗаявлениеУчебныйОтпуск);
		УстановитьВидимостьЭУ("НастройкиСервисаЗаявлениеОтпускБезОплаты", 	ДоступныеНастройки.ЗаявлениеОтпускБезОплаты);
		
		// Настройки отсутствия задним числом.
		УстановитьВидимостьЭУ("ОтпускОформлятьЗаднимЧислом", ИспользуетсяВерсияDTO_2_0 И ДоступныеНастройки.ЗаявлениеНаОтпуск);
		УстановитьВидимостьЭУ("ГруппаОтпускаЗаднимЧислом", ИспользуетсяВерсияDTO_2_0 И (ДоступныеНастройки.ЗаявлениеУчебныйОтпуск Или ДоступныеНастройки.ЗаявлениеОтпускБезОплаты));
		УстановитьВидимостьЭУ("УчебныйОтпускОформлятьЗаднимЧислом", 	ДоступныеНастройки.ЗаявлениеУчебныйОтпуск);
		УстановитьВидимостьЭУ("ОтпускЗаСвойСчетОформлятьЗаднимЧислом", 	ДоступныеНастройки.ЗаявлениеОтпускБезОплаты);
		
		// Переносы отпусков.
		УстановитьВидимостьЭУ("ГруппаНастройкаИсправленияЗаявокОтпуск", ДоступныеНастройки.ИспользоватьЗаявленияНаПереносОтпуска Или  ДоступныеНастройки.ИспользоватьЗаявленияНаОтменуОтпуска);
		УстановитьВидимостьЭУ("НастройкиСервисаИспользоватьЗаявленияНаПереносОтпуска", 	ДоступныеНастройки.ИспользоватьЗаявленияНаПереносОтпуска);
		УстановитьВидимостьЭУ("НастройкиСервисаИспользоватьЗаявленияНаОтменуОтпуска", 	ДоступныеНастройки.ИспользоватьЗаявленияНаОтменуОтпуска);
	
	КонецЕсли;
	
	// Заявления.
	УстановитьВидимостьЭУ("НастройкиСервисаЗаявленияНаВычетыНДФЛ", 					ДоступныеНастройки.ЗаявленияНаВычетыНДФЛ);
	УстановитьВидимостьЭУ("НастройкиСервисаИспользоватьПособияПриРожденииРебенка", 	ДоступныеНастройки.ИспользоватьПособияПриРожденииРебенка);
	УстановитьВидимостьЭУ("НастройкиСервисаИспользоватьПособияПоУходуЗаРебенком", 	ДоступныеНастройки.ИспользоватьПособияПоУходуЗаРебенком);
	УстановитьВидимостьЭУ("НастройкиСервисаЗапросНаИзменениеЛичнойИнформации", 		ДоступныеНастройки.ЗапросНаИзменениеЛичнойИнформации);
	УстановитьВидимостьЭУ("ГруппаИзменениеФото", 	ДоступныеНастройки.ДоступноИзменениеФото);
	УстановитьВидимостьЭУ("ГруппаЗаявленияДСВ", 	ДоступныеНастройки.ЗаявленияНаДСВ);
	
	// Отсутствия.
	ПоказыватьГруппуОтсутствия = ИспользуетсяВерсияDTO_2_0;
	УстановитьВидимостьЭУ("ГруппаОтсутствия", ПоказыватьГруппуОтсутствия);
	Если ПоказыватьГруппуОтсутствия Тогда
		
		УстановитьВидимостьЭУ("НастройкиСервисаБолезнь", 					ДоступныеНастройки.Болезнь);
		УстановитьВидимостьЭУ("НастройкиСервисаОтпускПоБеременностиИРодам", ДоступныеНастройки.ОтпускПоБеременностиИРодам);
		УстановитьВидимостьЭУ("НастройкиСервисаУходЗаРебенкомИнвалидом", 	ДоступныеНастройки.УходЗаРебенкомИнвалидом);
		УстановитьВидимостьЭУ("НастройкиСервисаОтпускПоУходуЗаРебенком", 	ДоступныеНастройки.ОтпускПоУходуЗаРебенком);
		УстановитьВидимостьЭУ("НастройкиСервисаКомандировка", 				ДоступныеНастройки.Командировка);
		УстановитьВидимостьЭУ("НастройкиСервисаОтгул", 						ДоступныеНастройки.Отгул);
		УстановитьВидимостьЭУ("НастройкиСервисаОпоздание", 					ДоступныеНастройки.Опоздание);
		УстановитьВидимостьЭУ("НастройкиСервисаОтсутствиеПоЛичнымОбстоятельствам", 	ДоступныеНастройки.ОтсутствиеПоЛичнымОбстоятельствам);
		УстановитьВидимостьЭУ("НастройкиСервисаВозвратИзОтпускаПоУходуЗаРебенком", 	ДоступныеНастройки.ВозвратИзОтпускаПоУходуЗаРебенком);
		
		// // Настройки отсутствия задним числом.
		ПоказыватьГруппуОтсутствияЗаднимЧислом = ДоступныеНастройки.Отгул Или ДоступныеНастройки.ОтсутствиеПоЛичнымОбстоятельствам Или ДоступныеНастройки.Командировка;
		УстановитьВидимостьЭУ("ГруппаОтсутствияЗаднимЧислом", ПоказыватьГруппуОтсутствияЗаднимЧислом);
		УстановитьВидимостьЭУ("ОтгулОформлятьЗаднимЧислом", 		ДоступныеНастройки.Отгул);
		УстановитьВидимостьЭУ("ЛичныеДелаОформлятьЗаднимЧислом", 	ДоступныеНастройки.ОтсутствиеПоЛичнымОбстоятельствам);
		УстановитьВидимостьЭУ("КомандировкаОформлятьЗаднимЧислом", 	ДоступныеНастройки.Командировка);
		
	КонецЕсли;
	
	// Охрана труда.
	ПоказыватьГруппуОхранаТруда = ДоступныеНастройки.ПоказыватьОхрануТруда;
	УстановитьВидимостьЭУ("ГруппаОхранаТруда", ПоказыватьГруппуОхранаТруда);
	Если ПоказыватьГруппуОхранаТруда Тогда
		
		УстановитьВидимостьЭУ("НастройкиСервисаПоказыватьРабочиеМестаОхраныТруда", 	ДоступныеНастройки.ПоказыватьРабочиеМестаОхраныТруда);
		УстановитьВидимостьЭУ("НастройкиСервисаПоказыватьМедицинскиеОсмотры", 		ДоступныеНастройки.ПоказыватьМедицинскиеОсмотры);
		УстановитьВидимостьЭУ("НастройкиСервисаПоказыватьПсихиатрическиеОсвидетельствования", ДоступныеНастройки.ПоказыватьПсихиатрическиеОсвидетельствования);
		
		Если Не ИспользуетсяВерсияDTO_3_1 Тогда
			ЗаголовокПоказыватьОхрануТруда = НСтр("ru = 'Показывать сведения о рабочих местах в кабинете сотрудника'");
			УстановитьВидимостьЭУ("ГруппаРазделыОхраныТруда", Ложь);
		Иначе
			ЗаголовокПоказыватьОхрануТруда = НСтр("ru = 'Показывать данные охраны труда в кабинете сотрудника'");
			УстановитьДоступностьПодчиненныхНастроекОхраныТруда(ЭтаФорма);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкиСервисаПоказыватьОхрануТруда", "Заголовок", ЗаголовокПоказыватьОхрануТруда);
		
	КонецЕсли;
	
	// Прочие.
	УстановитьВидимостьЭУ("ГруппаУровниДоступаКИ", ДоступныеНастройки.УровеньДоступаКИ);
	УстановитьВидимостьЭУ("НастройкиСервисаДоступенОтказОтПодписания", ДоступныеНастройки.ДоступенОтказОтПодписания);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭУ()

	УстановитьДоступностьДоплатКОтпуску(ЭтаФорма);
	ОбновитьЭУКоличествоДнейДоНачалаОтпуска(ЭтаФорма);
	ОбновитьЭУОтпускОформлятьЗаднимЧислом(ЭтаФорма);
	УстановитьДоступностьПодчиненныхНастроекОхраныТруда(ЭтаФорма);
	ОбновитьДоступностьЭУДнейДоНачалаОтпуска(ЭтаФорма, Ложь);
	ОбновитьЭУМаксимальноеКоличествоДнейОтпускаАвансом(ЭтаФорма);
	УстановитьДоступностьДоступноИзменениеФото(ЭтаФорма);
	ОбновитьЭУСпособРасчетаДСВ(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУКоличествоДнейДоНачалаОтпуска(Форма)
	
	Элементы = Форма.Элементы;
	КонтролироватьДатуНачалаОтпуска = Форма.НастройкиОтпуска.КонтролироватьДатуНачалаОтпускаПриПодачеЗаявления;
	Элементы.КоличествоДнейДоНачалаОтпуска.Доступность = КонтролироватьДатуНачалаОтпуска;
	Элементы.КоличествоДнейДоНачалаОтпуска.АвтоОтметкаНезаполненного = КонтролироватьДатуНачалаОтпуска;
	Элементы.КоличествоДнейДоНачалаОтпуска.ОтметкаНезаполненного = Не КонтролироватьДатуНачалаОтпуска Или КонтролироватьДатуНачалаОтпуска И Не ЗначениеЗаполнено(Форма.НастройкиОтпуска.КоличествоДнейДоНачалаОтпуска);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУМаксимальноеКоличествоДнейОтпускаАвансом(Форма)
	
	Элементы = Форма.Элементы;
	Если Форма.НастройкиОтпуска.ОграничиватьПредоставлениеОтпускаАвансом Тогда
		
		Элементы.ОтпускАвансомНеПредоставляется.Доступность = Истина;
		Элементы.ОтпускАвансомПредоставляется.Доступность 	= Истина;
		Элементы.МаксимальноеКоличествоДнейОтпускаАвансом.Доступность = (Форма.ОтпускАвансомПредоставляется = 1);
		
		Элементы.МаксимальноеКоличествоДнейОтпускаАвансом.АвтоОтметкаНезаполненного = (Форма.ОтпускАвансомПредоставляется = 1);
		Элементы.МаксимальноеКоличествоДнейОтпускаАвансом.ОтметкаНезаполненного = (Форма.ОтпускАвансомПредоставляется = 1)
				И Форма.НастройкиОтпуска.МаксимальноеКоличествоДнейОтпускаАвансом = 0;
		
	Иначе
		
		Элементы.ОтпускАвансомНеПредоставляется.Доступность = Ложь;
		Элементы.ОтпускАвансомПредоставляется.Доступность 	= Ложь;
		Элементы.МаксимальноеКоличествоДнейОтпускаАвансом.Доступность = Ложь;
		Элементы.МаксимальноеКоличествоДнейОтпускаАвансом.АвтоОтметкаНезаполненного = Ложь;
		Элементы.МаксимальноеКоличествоДнейОтпускаАвансом.ОтметкаНезаполненного = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭУ(ИмяЭлементоа, ВидимостьЭлемента)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлементоа, "Видимость", ВидимостьЭлемента);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоплатКОтпуску(Форма)

	Форма.Элементы.НастройкиСервисаМатериальнаяПомощьКОтпуску.Доступность 		= Форма.НастройкиСервиса.ЗаявлениеНаОтпуск;
	Форма.Элементы.НастройкиСервисаЕдиновременнаяВыплатаКОтпуску.Доступность 	= Форма.НастройкиСервиса.ЗаявлениеНаОтпуск;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУОтпускОформлятьЗаднимЧислом(Форма)
	
	Форма.Элементы.КонтролироватьДатуНачалаОтпускаПриПодачеЗаявления.Доступность = Не Форма.ОтпускОформлятьЗаднимЧислом;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПодчиненныхНастроекОхраныТруда(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НастройкиСервисаПоказыватьРабочиеМестаОхраныТруда", "Доступность", Форма.НастройкиСервиса.ПоказыватьОхрануТруда);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НастройкиСервисаПоказыватьМедицинскиеОсмотры", "Доступность", Форма.НастройкиСервиса.ПоказыватьОхрануТруда);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НастройкиСервисаПоказыватьПсихиатрическиеОсвидетельствования", "Доступность", Форма.НастройкиСервиса.ПоказыватьОхрануТруда);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДоступностьЭУДнейДоНачалаОтпуска(Форма, УстановитьЗначение)

	НастройкаДоступна = Форма.НастройкиСервиса.ИспользоватьЗаявленияНаПереносОтпуска
		Или Форма.НастройкиСервиса.ИспользоватьЗаявленияНаОтменуОтпуска;
		
	Форма.Элементы.ГруппаНастройкиОтпускаДни.Доступность = НастройкаДоступна;
	
	Если УстановитьЗначение Тогда
		Если НастройкаДоступна Тогда
			Если Форма.ОтпускДнейДоНачалаОтсутствияОтмена = 0 Тогда
				Форма.ОтпускДнейДоНачалаОтсутствияОтмена = 7;
			КонецЕсли;
			Если Форма.ОтпускЗаСвойСчетДнейДоНачалаОтсутствияОтмена = 0 Тогда
				Форма.ОтпускЗаСвойСчетДнейДоНачалаОтсутствияОтмена = 7;
			КонецЕсли;
		Иначе
			Форма.ОтпускДнейДоНачалаОтсутствияОтмена = 0;
			Форма.ОтпускЗаСвойСчетДнейДоНачалаОтсутствияОтмена = 0;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоступноИзменениеФото(Форма)

	Форма.Элементы.НастройкиСервисаДоступноИзменениеФото.Доступность = Форма.НастройкиСервиса.ЗапросНаИзменениеЛичнойИнформации;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУСпособРасчетаДСВ(Форма)

	Элементы = Форма.Элементы;
	Элементы.НастройкиСервисаСпособРасчетаДСВПроцентом.Доступность = Форма.НастройкиСервиса.ЗаявленияНаДСВ;
	Элементы.НастройкиСервисаСпособРасчетаДСВПроцентомНеБолееСуммы.Доступность = Форма.НастройкиСервиса.ЗаявленияНаДСВ;
	Элементы.НастройкиСервисаСпособРасчетаДСВСуммой.Доступность = Форма.НастройкиСервиса.ЗаявленияНаДСВ;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СервисЗаблокирован()

	Возврат ИнтеграцияКабинетСотрудника.ПриложениеЗаблокировано();

КонецФункции

#КонецОбласти
